package com.javarush.test.level00.lesson03.task02;

/* На дворе 31 век
Написать программу, выводящую на экран нынешний год. На дворе 31 век, если что.
*/
public class Solution
{
    public static void main(String[] args)
    {
        System.out.println(3014);
    }
}
