package com.javarush.test.level00.lesson03.task03;

/* Амиго очень умный
Написать программу, выводящую на экран надпись «Амиго очень умный».
*/
public class Solution
{
    public static void main(String[] args)
    {
        System.out.println("Амиго очень умный");
    }
}
